class Solution {
public:
    int numDecodings(string s) {
        
        // ¶¯Ì¬¹æ»®
        // Èç¹ûÐòÁÐÎª [1, 2,3,4]
        // ¶ÔÓÚ4,Ö»ÄÜÈ¡Ò»¸ö£¬1
        // ¶ÔÓÚ3,Ö»ÄÜÈ¡Ò»¸ö£¬×ÜÊý¼´4µÄ×ÜÊý,1
        // ¶ÔÓÚ2,È¡Ò»¸öÊ±,×ÜÊý¼´3µÄ×ÜÊý,1.È¡Á½¸öÊ±,×ÜÊý¼´4µÄ×ÜÊý,1.×Ü¹²Îª 1 + 1 = 3
        // ¶ÔÓÚ1,È¡Ò»¸öÊ±,×ÜÊý¼´2µÄ×ÜÊý,2.È¡Á½¸öÊ±,×ÜÊý¼´3µÄ×ÜÊý,1.×Ü¹²Îª  2 + 1 = 3£»
        if(s.size() < 1)
            return 0;
        if(s.size() == 1)
            return s[0] != '0';
        int c = 1;
        int b = s[s.size() - 1] == '0' ? 0 : 1;
        int i = s.size() - 2;
        int a = 1;
        while(i >= 0)
        {
            char c1 = s[i];
            char c2 = s[i + 1];
            if(c1 == '0' && (c2 == '0' ||((i - 1 >= 0 && !( '1' <= s[i - 1] && s[i - 1] <= '2')) || (i - 1) < 0)))
                return 0;
            
            if(c1 == '0')
            {
                a = 0;
            }
            
            if ('1' <= c1 && c1 <= '2')
            {
                if(c1 < '2' || (c1 == '2' && '1' <= c2 && c2 <= '6'))
                {
                    a = b + c;
                }
                else if('0' == c2)
                {
                    a = c;
                    
                }
                else
                    a = b;
            }
            // c1 >= 3
            if(c1 >= '3')
            {
                a = b;
            }
            c = b;
            b = a;
            i--;
        }
        
        return a;
    }
};
